app/views/vacations/find_activity.html.erb

    <%= label_tag :name %>
    <%= select_tag :name, options_for_select(@vacation.destination.activities.collect{|activity| activity.name}) %>
---
SELECT "activities".* FROM "activities" WHERE "activities"."destination_id" = $1  [["destination_id", 7]]
SELECT "destinations".* FROM "destinations" WHERE "destinations"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]