app/views/vacations/show.html.erb

        <ul>
        <% @vacation.destination.highlights_to_hash.each do |key, value|%>
---
SELECT "destinations".* FROM "destinations" WHERE "destinations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

<h3>Activities</h3>
<% if @vacation.activities.size > 0 %>
    <ul>
        <% @vacation.activities.each do |activity| %>
            <li> <%= activity.name %>, price: $<%= activity.price %> <%= button_to "Delete", delete_activity_path(VacationActivity.find_by(activity: activity)), { id: "submit_button", method: "delete"} %> </li>
---
SELECT "activities".* FROM "activities" INNER JOIN "vacation_activities" ON "activities"."id" = "vacation_activities"."activity_id" WHERE "vacation_activities"."vacation_id" = $1  [["vacation_id", 2]]
SELECT COUNT(*) FROM "activities" INNER JOIN "vacation_activities" ON "activities"."id" = "vacation_activities"."activity_id" WHERE "vacation_activities"."vacation_id" = $1  [["vacation_id", 4]]
SELECT "activities".* FROM "activities" INNER JOIN "vacation_activities" ON "activities"."id" = "vacation_activities"."activity_id" WHERE "vacation_activities"."vacation_id" = $1  [["vacation_id", 4]]
SELECT "vacation_activities".* FROM "vacation_activities" WHERE "vacation_activities"."activity_id" = $1 LIMIT $2  [["activity_id", 36], ["LIMIT", 1]]