app/views/users/show.html.erb


<%if current_user.vacations.size > 0%>
---
SELECT "vacations".* FROM "vacations" WHERE "vacations"."user_id" = $1  [["user_id", 10]]
SELECT COUNT(*) FROM "vacations" WHERE "vacations"."user_id" = $1  [["user_id", 10]]

<ol>
<%@current_user.vacations.each do |vaca|%>
---
SELECT "vacations".* FROM "vacations" WHERE "vacations"."user_id" = $1  [["user_id", 10]]