app/controllers/destinations_controller.rb

    def index
        @destinations = Destination.all
---
SELECT "destinations".* FROM "destinations" ORDER BY "destinations"."id" ASC LIMIT $1  [["LIMIT", 1]]

    def find_destination
        @destination = Destination.find(params[:id])
---
SELECT "destinations".* FROM "destinations" WHERE "destinations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]