app/controllers/flights_controller.rb

    def destroy_departure
        @flight = Flight.destroy(params[:id])
---
DELETE FROM "flights" WHERE "flights"."id" = $1  [["id", 4]]

    def destroy_arrival
        @flight = Flight.destroy(params[:id])
---
DELETE FROM "flights" WHERE "flights"."id" = $1  [["id", 2]]