app/controllers/users_controller.rb

    def handle_login
        @user = User.find_by(username: params[:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "james"], ["LIMIT", 1]]

    def create
        @user = User.create(user_params)
---
INSERT INTO "users" ("name", "username", "password_digest", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

    def update_password
        if @current_user && @current_user.authenticate(params[:current_password])
            if @current_user.password_match?(params[:password], params[:password_confirmation])
                @current_user.update(password: params[:password])
---
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "$2a$12$On.9Kyd0oycP2fSz7Ok7YObUPykvuye35GXtGexvADjJR9ctz7nsC"], ["updated_at", "2021-02-16 17:39:10.447092"], ["id", 12]]

    def update
        @current_user.update(user_params)
---
UPDATE "users" SET "name" = $1, "username" = $2, "email" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["name", "max "], ["username", "max3"], ["email", "max4@gmail.com"], ["updated_at", "2021-02-17 20:34:47.536251"], ["id", 4]]