app/controllers/vacations_controller.rb

INSERT INTO "vacation_activities" ("activity_id", "vacation_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["activity_id", 39], ["vacation_id", 4], ["created_at", "2021-02-18 19:17:46.340517"], ["updated_at", "2021-02-18 19:17:46.340517"]]
---
    def add_activity
        @vaca_activity = VacationActivity.create(vacation: find_vacation, activity: find_vacation.search_for_activity(params[:name]))

DELETE FROM "vacations" WHERE "vacations"."id" = $1  [["id", 1]]
---
    def destroy
        @vacation.destroy

SELECT "vacations".* FROM "vacations" WHERE "vacations"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def find_vacation
        @vacation = Vacation.find(params[:id])