app/controllers/vacation_activities_controller.rb

SELECT "vacation_activities".* FROM "vacation_activities" WHERE "vacation_activities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "vacation_activities" WHERE "vacation_activities"."id" = $1  [["id", 1]]
---
    def destroy
        @vaca_activity = VacationActivity.find(params[:id])
        @vaca_activity.destroy