app/controllers/vacations_controller.rb

SELECT "vacations".* FROM "vacations" WHERE "vacations"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def find_vacation
        @vacation = Vacation.find(params[:id])