app/controllers/vacations_controller.rb

SELECT "destinations".* FROM "destinations"
---
    def new
        @destinations = Destination.all

INSERT INTO "vacations" ("user_id", "destination_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 3], ["destination_id", 1], ["created_at", "2021-02-16 19:25:27.675779"], ["updated_at", "2021-02-16 19:25:27.675779"]]
---
    def create
        @vacation = Vacation.create(vacation_params)

INSERT INTO "arrivals" ("vacation_id", "flight_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["vacation_id", 3], ["flight_id", 3], ["created_at", "2021-02-17 16:43:26.460920"], ["updated_at", "2021-02-17 16:43:26.460920"]]
INSERT INTO "departures" ("vacation_id", "flight_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["vacation_id", 3], ["flight_id", 4], ["created_at", "2021-02-17 16:45:45.025802"], ["updated_at", "2021-02-17 16:45:45.025802"]]
INSERT INTO "flights" ("departure_time", "arrival_time", "created_at", "updated_at", "destination_airport") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["departure_time", "9:00am"], ["arrival_time", "12:00pm"], ["created_at", "2021-02-17 16:43:26.407709"], ["updated_at", "2021-02-17 16:43:26.407709"], ["destination_airport", "LAX"]]
INSERT INTO "flights" ("departure_time", "arrival_time", "created_at", "updated_at", "destination_airport") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["departure_time", "9:00am"], ["arrival_time", "12:00pm"], ["created_at", "2021-02-18 19:18:14.229317"], ["updated_at", "2021-02-18 19:18:14.229317"], ["destination_airport", "JAM"]]
---
    def create_flight
        @flight = Flight.create(arrival_time: params[:arrival_time], departure_time: params[:departure_time], destination_airport: params[:destination_airport] )
        params[:return_or_depart] == "Departing Flight" ? Departure.create(flight_id: @flight.id, vacation_id: find_vacation.id) : Arrival.create(flight_id: @flight.id, vacation_id: find_vacation.id)

DELETE FROM "vacations" WHERE "vacations"."id" = $1  [["id", 3]]
---
    def destroy
        @vacation.destroy

SELECT "vacations".* FROM "vacations" WHERE "vacations"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def find_vacation
        @vacation = Vacation.find(params[:id])