app/models/vacation.rb

SELECT "activities".* FROM "activities" WHERE "activities"."destination_id" = $1  [["destination_id", 8]]
---
  def search_for_activity(name)
    destination.activities.find {|activity| activity.name == name}