app/views/destinations/show.html.erb

SELECT "activities".* FROM "activities" WHERE "activities"."destination_id" = $1  [["destination_id", 7]]
---
<ul>
    <% @destination.activities.each do |activity| %>